//#include <stdio.h>

/*
버그를 경험했을거다.

코드를 디버깅 하는법.

버그란 의도하지 않은 프로그램
내 실수를 뜻한다.

에러가 나면 가장 위에 에러문자를 봐라.

명령어를 실핼할 떄 문제가 생겼다거나 이상한 메세지
들이 나온다면 help50을 입력해라(터미널에)

터미널 초기화방법 1. 컨트롤 + ㅣ, 2. clear 입력

새로운 디버깅하는법 printf를 해서 뭔가 틀린지 보는법

cd(change 디렉토리) 디렉토리를 바꿔라.

코드 왼쪽에 잇는 행 수를 클릭하면 옆에 빨간색 점이 생김.(중지점)(멈추라는 정지표시)

help50는 에러 메세지를 이해할 수 있도록 도와줌.
debug50는 프로그램을 단계별로 실행할 수 있도록 해주는 거죠.
step over을 실행하면 코드를 한줄씩 실행해서 누를떄마다
프로그램 실행 과정을 볼수있어 알아낼수 있다.

코드를 실행할 떄 버그가 생기고 에러 메세지를 이해할수 없다면
help50을 이용해라

debug50은 나의 직감으로 되어야한다.
*/


/*int main_디버깅(void)
{
	printf("hello, world\n");
} */