#include <stdio.h>

int main_디자인(void)
{
	printf("hello, world\n");
}

/*
check50 
우리가 회사에서 일을 하거나 소프트웨어를 작성할떄
코드 작성만큼이나 중요한 것이 바로 코드가 정확한지를 
확인하는 테스트를 만드는 것.
특히 우리나 다른 사람들이 여러분의 프로그램에 새로운
기능을 추가할때 프로그램이 고장나지 않도록 작동 여부를
계속해서 확인해줘야함.

style50
c와 같은 언어로 프로그래밍을 할떄는 코드를 작성할떄 조금
게을러질 수 있다. 흔한일.(가독성없이 쓰는것.)
코드 작성 시에는 여러분 자신과 다른 사람들이 읽기 쉽도록
그리고 무엇보다 유지보수하기 쉽도록 해야한다.
몇주뒤에 고칠려하면 무슨 코드를 짲는지도 모른다.
좋은 코드 작성 스타일을 갖는 건 프로그래밍에서 필수적인 부분.

코드가 잘 안되고 오류가나고 생각이 안날떄는
인형한테 하나하나 애기하면서 이해한다.

코드 잘짜는것
1. 정확하게 짜였는가?
2. 코드는 보기 좋은가?
3. 코드는 잘 디자인 되있는가?
*/

