#include <stdio.h>

int main(void) // 함수는 나중에 설명.
{
	// int : 자료형 (바뀔수 없다. int에 역할을 하는 것이 바뀔수없다.) 
	// i : 변수명(변수에 해당하는 부분은 이름을 준것이라 i라고만 고정이 아니고 마음대로 가능)

	// 자료형 : 변수가 어떠한 형태를 나타내는지를 설명해주는 역할이 자료형에 역할.
	//        : (크기단위, byte) Date Type
	// 정수형 : char(1) , short(2), int(4) , long(4) , long long(8) ,더있슴
	// 실수형 : float(4), double(8)


	int i = 0; // 1.i안에 들어가는 데이터는 정수 표현방식을 따른다. 2. i라는 변수의 크기는 4바이트이다.
	
	unsigned char c = 0; // 1바이트 양의 정수만 내포하는 자료형.
	c = 0;
	c = 256; 
	



	return 0;
 }
