/*
비쥬얼 스튜디오 2022킨다.

c++ 빈프로젝트 만들고

헤더파일에서 새로운 파일만듬

c++파일을 만듬 컴파일 과정을 통해서 만듬

초반에는 설명을 못하고 넘어갈수 있다.
지금은 스킵할수 있지만 나중에 알려준다.

수업하기전 당부 사항:
디테일 하게 처음부터 차근차근설명할거다.

첫날부터 기초를 이론들은 게임작품을 만들수 없다고 생각되지만 원초적인 암기상황들이 많다.

흥미를 잃을수도있지만 언어라는 특성때문에 외워야한다. 일정수준 이상 사용할려면 인내가 필요.(암기)

그 상황이 오기전에는 암기상황이 많다.

암기를 했다. 당일 하루 이틀전까지는 대답할 수준은 안된다.

하루 다음날 전까지는 복습없이 대답하지만 2일 3일쯤 되면 대답을 거의 못한다.

기초를 응용하고 활용해도 2~3일 일주일 지나고 다시보면 기억이 안난다.
시간이 지나면 사람은 기억이 희미해짐.

베이스 기초.!!!! 잊어버리면 안된다.!!!!!!

이 부분을 배울떄 정리를 해야한다.

기초부분은 잊으면 안된다.

시간이 지날수록 잊어간다.

지식 총량은 늘어나지만 구멍이(까먹음) 생긴다

그렇지만 정리를 잘하면 다시 외워진다.

계속해서 복습하면 복습시간이 짧아진다.

필기노트보다는
블로그에 정리하는걸 추천한다.
(자기가 알아볼수있도록 간단하게 정리하는걸 추천)
접근성 용이
*/


// 주석
// 슬레쉬 2번을 치면 초록색으로 보이게됨.(주석처리됬다)
// 슬래쉬 2번친거는 코드로 인식되지않는다(없는취급)
// 주석은 1. 내가 작성한 코드가 어떤 역할을 하는지 
//        2. 필요한 내용을 설명할떄 주석담.
#include <stdio.h>

int main_a(void) // 함수는 나중에 설명.
{



	return 0;
}
